src/Documents/УведомлениеМЭДО/УведомлениеМЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеМЭДО</name>
  <registerRecords>InformationRegister.СостоянияДокументовМЭДО</registerRecords>
  <attributes>
    <name>ВерсияМЭДО</name>
    <comment>Хранится &quot;для истории&quot;, при отправке первична версия в настройках контрагента</comment>
    <type>
      <types>EnumRef.ВерсииФорматаМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовоКОтправке</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКонверта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ПредметМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходящегоСообщения</name>
    <comment>Для входящего уведомления</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Не более 2047 символов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияСообщенийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ОтветственныйМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <comment>Для исходящего</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ТипыУведомленийМЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправлениеДоклада</name>
    <comment>reportSent</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Опубликование</name>
    <comment>documentPublished</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПечатныйОрган</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтказВРегистрации</name>
    <comment>documentRefused</comment>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВРегистрацииМЭДО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодготовкаДоклада</name>
    <comment>reportPrepared</comment>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПодписания</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль</name>
    <comment>documentSent</comment>
    <attributes>
      <name>ТребуетсяРегистрация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяИсполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПубликация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктыДокументаПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостановкаНаКонтроль_КонтрольныеПунктыДокумента</name>
    <attributes>
      <name>ИдентификаторПункта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>максимум 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПоПорядку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПункта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПринятиеКИсполнению</name>
    <comment>executorAssigned</comment>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийИсполнителя</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяПодразделения</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийРуководителяСекретаря</name>
      <comment>не больше 2047 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделения</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПодразделенияПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарь</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительСекретарьПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регистрация</name>
    <comment>documentAccepted</comment>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>DefinedType.РегистрационныйНомер</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХодИсполнения</name>
    <comment>courseChanged</comment>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Юрлицо</name>
      <type>
        <types>DefinedType.ЮрлицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеХодаИсполнения</name>
      <comment>до 4000 символов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>DefinedType.КонтактноеЛицоМЭДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/УведомлениеМЭДО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ИдентификаторУведомления");
	Поля.Добавить("ИдентификаторДокумента");
	Поля.Добавить("Документ");
	Поля.Добавить("Направление");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон(
		НСтр("ru = '%1 уведомление МЭДО %2 (на %3)'"), 
		Данные.Направление,
		Данные.ИдентификаторУведомления,
		МЭДО.ЗаполненноеЗначение(Данные.Документ, Данные.ИдентификаторДокумента));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
